importing libraries

In [1]:
import pandas as pd
import numpy as np

opening local csv file

In [3]:
df = pd.read_csv("homeprices (1).csv")

In [4]:
df

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

Opening a csv file from url

In [5]:
import requests
from io import StringIO


url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
req = requests.get(url)
req.raise_for_status()

df = pd.read_csv(StringIO(req.text))

df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

sep parameter

In [ ]:
pd.read_csv("homeprices (1).csv", sep='\t', names=[])

    area,price
0  2600,550000
1  3000,565000
2  3200,610000
3  3600,680000
4  4000,725000

Index_col parameter

In [14]:
pd.read_csv("homeprices (1).csv", index_col='area')

       price
area
2600  550000
3000  565000
3200  610000
3600  680000
4000  725000

Header parameter

In [15]:
pd.read_csv("homeprices (1).csv", header=1)

   2600  550000
0  3000  565000
1  3200  610000
2  3600  680000
3  4000  725000

use col parameter

In [16]:
pd.read_csv("homeprices (1).csv", usecols=['area','price'])

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

squeeze parameters

In [17]:
pd.read_csv("homeprices (1).csv", usecols=['area'], squeeze=True)

TypeError: read_csv() got an unexpected keyword argument 'squeeze'

skip rows/nrows parameter

In [ ]:
pd.read_csv("homeprices (1).csv", nrows=90) #this will give the number of rows

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

Encoding parameter

In [ ]:
pd.read_csv('',encoding='encoding name')  #used for the encoded csv

skip bad lines

In [ ]:
pd.read_csv('',sep=',', encoding='encoder name',error_bad_lines = False)  # for having a mismatched columns

Dtypes

In [ ]:
pd.read_csv("homeprices (1).csv", dtype={'area': int}).info()  # used to convert the datatype of a column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   area    5 non-null      int64
 1   price   5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

handling dates

In [ ]:
pd.read_csv('',parse_dates=['date'])   # to keep the date datatype not in character or convert the char data to date

convertors

In [ ]:
pd.read_csv('',converters={'team1':rename})  #creating a short name to long names using other user defined functions

na_values parameter

In [ ]:
pd.read_csv("homeprices (1).csv",na_values=['-'])   #specify the values to be a null values (- = null)

loading a huge dataset in chunks

In [ ]:
df = pd.read_csv("homeprices (1).csv", chunksize=50)  #to divide the huge data into chunks

In [21]:
for chunks in df:
    print(chunks.shape)

(5, 2)